[{"title": "Bi, The Urban Bike", "summary": "Conception, illustration and 3D modeling", "body": "Conception of an electric foldable bicycle that can easily fit into a trunk and is easy to charge. This bike is designed for small trips into the city, eliminating the need to take the car inside urban areas.\n\n*2013*\n\n\n\n[lp=Bi Poster.jpg]\n\n\n[lp=Bi Closed.jpg]\n\n[lp=Bi Pliage.jpg]\n\n\nThe ingenious folding mechanism provides a quick and elegant transition into a very compact shape. The folding happens in two different axes. The back wheel rotates upward and the front wheel rotates laterally to fit in the center of the frame.\n\n\n\n**&&Some skteches&&**\n\n[lp=Bi Sketch.jpg]\n\n\n[lp=Bi Illustration.jpg]\n\n\n\n**&&Features&&**\n\n[lp=3 Technologies.jpg]\n\n\n[lp=Bi Back.jpg]\n\n\n[lp=Bi My Man.jpg]", "image": "Bi Cover.jpg", "id": 4}, {"title": "The Grid, Tramway", "summary": "Conception and 3D modeling", "body": "Design of a tramway and 3D modeling with Rihnoceros and Cinema4D\n\n*2012*\n\n\n\n[lp=Tramway Poster.jpg]\n\n\n[lp=Side Views.jpg]\n\n\n**&&Sketches and process&&**\n\n[lp=Tramway Sketches.jpg]\n\n\n&&Chosen Concept&&\n[lp=Tramway Sketch.jpg]\n\n\n{**&&3D modeling&&**}\n[lp=Tram Monitor.jpg]\n\n\n\n\n**&&Electric blue&&**\n\n[lp=Tramway Light.jpg]\n\n\n[lp=Tramway Above.jpg]\n\n\n[lp=Tramway Dark.jpg]", "image": "Tramway Cover.jpg", "id": 7}, {"title": "Tisch der Geduld", "summary": "Developing a concept around the theme Tempus fugit (time flies)", "body": "Throught time and care, a bonsai can live for more than a hundred years. The bonsai slowly grows into its perfect form and gives its caregiver a sense of accomplishment and pride. It teaches discipline and focus.\nThe bonsai represents balance, meditation and harmony. Which makes it a perfect symbol for the enjoyment of the passing time. However, the bonsai requires a lot of time and patience, which could be intimidating for the beginners.\n\n*Tisch der Geduld (table of patience)* is a beginner's kit that simplifies the care for the bonsai, making it accessible to anyone. The daily watering of the plant can be done on the table itself and the turn table facilitates the trimming of the tree. The table itself acts as a pedestal for the miniature tree.\n\n*Made in Halle, Germany*\n*2014*\n\n<iframe src=\"https://player.vimeo.com/video/127985544?color=ffffff&title=0&byline=0&portrait=0\" width=\"700\" height=\"395\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe>\n\n\n[lp=Tisch complete.jpg]\n\n\n[gfycat=AggravatingNauticalHalicore]\n\n\nBy analysing the workspace of a bonsai professional, we can identify the necessary components for the care of the bonsai : a low table, a turning plate, a tool box and watering equipment.\n\n\n[lp=Workstation.jpg]\n\n\n**&&Sketches&&**\n[lp=Sketche Bonsai.jpg]\n\n\n**&&Production&&**\n\n[lp=Process.jpg]\n\n\n**&&Functioning&&** \n\n[lp=Exploded.jpg]\n\n\n[lp=Watering Bonsai.jpg]\n\n\n[lp=Tisch render.jpg]\n\n\n[lp=trimming.jpg]\n\n\n[lp=Tisch Closeuo.jpg]", "image": "Bonsai Cover.jpg", "id": 10}, {"title": "Maestro", "summary": "Research, conception and model", "body": "Rethinking the space designated for the subway musicians by meeting their needs and promoting interaction with commuters.\n\n\n*2015*\n*Special thank to Ehsan Kia*\n\n[lp=Poster Render.jpg]\n\n\n<iframe src=\"https://player.vimeo.com/video/127653503?color=ffffff&title=0&byline=0&portrait=0\" width=\"700\" height=\"394\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe>\n\n\n**&&Functioning&&**\nMaestro is a pod for subway musicians to help them stand out and also better interact with commuters.\n\nThe information is managed via the website. On this portal, musicians can enter their information which will then be displayed on the pod's screen. On the other hand, travelers can also visit this website to learn more about the musicians and to know their schedules.\n[lp=Ecosystem site.jpg]\nThe musican can access the pod by scanning his card. His information is then displayed on the screen and the seat is unlocked.\n\n\n[lp=Graphique Maestro Site 3.jpg]\n\n\n**&&Like button&&**\nThis feature allows travelers to show their appreciation by simply walking on a decal Like button. The users is thanked on the screen and the counter adds the likes.\n\nThe Like button plays the ice breaker between people and the artist. As a result, the commuter has more chance to give a tip or check out the artist on the internet\n\n\n[lp=Camera site.jpg]\n\n\n[lp=Graphique Maestro Site 2.jpg]\n\n\n**&&Easy to install&&**\n\n[lp=Explosee site.jpg]\n\n\n**&&Brainstorm&&**\n\n[lp=Sketch Site.jpg]\n\n\n**&&Prototype&&**\n\n[lp=fabrication.jpg]\n\n\n[lp=Ingrid Like.jpg]", "image": "Maestro cover.jpg", "id": 11}, {"body": "Repenser l’espace alloué aux musiciens de façon à répondre à leurs besoins et de les valoriser aux yeux des usagers du métro.\n\n\n*Hiver 2015*\n*Remerciement spécial à Ehsan Kia*\n\n[lp=Poster Render.jpg]\n\n\n<iframe src=\"https://player.vimeo.com/video/127653502?color=ffffff&title=0&byline=0&portrait=0\" width=\"700\" height=\"394\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe>\n\n\n**&&Fonctionnement&&**\nMaestro est une borne qui permet de distinguer clairement le musicien et de favoriser l’échange entre lui et les passants de manière ludique.\n\nLa gestion de l’information se fait à l’aide du site web. Sur ce portail, les musiciens peuvent entrer leurs informations qui seront ensuite affichées à l’écran de la borne lorsque le musicien se sera identifié. Puis, le public peut également consulter ce site pour s’informer sur les musiciens et pour connaître leurs horaires.\n\n\n[lp=Graphique Maestro FR 3.jpg]\n\nLe musicien accède à la borne en balayant sa carte membre. Puis, son information s'affiche à l'écran et le siège de débarre.\n\n\n[lp=Graphique Maestro FR 2.jpg]\n\n\n**&&Bouton J'aime&&**\nLe bouton J’aime permet de montrer son appréciation au musicien sans être obligé de piger dans sa poche. Lorsque quelqu’un marche sur le décalque par terre, la caméra détecte le mouvement, un message de remerciement apparait sur l’écran et le compteur monte.\n\n\n[lp=Camera FR.jpg]\n\n\n[lp=Graphique Maestro FR 1.jpg]\n\n\n**&&Facile d'installation&&**\n\n[lp=Explosee site.jpg]\n\n\n**&&Brainstorm&&**\n\n[lp=Sketch Site.jpg]\n\n\n**&&Prototype fonctionnel&&**\n\n[lp=fabrication.jpg]\n\n\n[lp=Ingrid Like.jpg]", "image": "Maestro cover.jpg", "summary": "Borne pour musiciens du métro", "id": 12, "title": "Maestro (fr)"}, {"title": "Kids' Sport Store", "summary": "Conception, development and project management", "body": "This flagship store located at Vaughan Mills near Toronto is a first of its kind. This sport store offers exclusively products for kids, from infant to 14 years old.\n\nThus, all the fixtures have been conceived with the kids in mind. The kid-focused features don't stop at providing fixtures of different sizes, it also offers an interactive experience throughout the shopping process.\n\n*2018*\n\n\n<iframe width=\"700\" height=\"394\" src=\"https://www.youtube.com/embed/Gx7P8iD1XiU?rel=0&amp;showinfo=0\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen></iframe>\n\n\n**&&Modular Blocks&&**\nThe block modules allow for a great flexibility across the store. These building blocks can be moved and stacked as desired. Moreover, they can easily be fitted with multiple accessories using an insert system, so that the blocks can adapt to any kind of merchandising without needing to replace the main fixture. For example, these blocks are used as display in the main window presentation, they are used as benches of different heights and also as lead in fixtures, among other things. \n\n[lp=Sport Chek Kids - Bench.jpg]\n[sp=Sport Chek Kids - Footwear 2.jpg][sp=Sport Chek Kids - Lead In.jpg][sp=Sport Chek Kids - Window Display 2.jpg]\n\n[lp=Sport Chek Kids - Interactive Game.jpg]\n*Interactive soccer game in the shoe department*\n\n\n**&&Shoe Table&&**\nThis interactive shoe table has been conceived with flexibility and efficiency in mind. The smaller segment can be moved and nested inside the larger one and they can store up to 16 shoe boxes. This way, the employee can produce the right shoe size on the spot, without needing trip to th backstore. Some of these table are equipped with a media module capable of scanning display shoes and showing information about features and availability of the product.\n\n[lp=Sport Chek Kids - Shoe Table 2.jpg]\n\n\n**&&Cash Desk & Tech Wall&&**\n\n[lp=Sport Chek Kids - Cash Desk.jpg]\n[lp=Sport Chek Kids - Tech Wall.jpg]\n\n\nPhotos : *Sport Chek*\nSource : *https://www.retail-insider.com/retail-insider/2018/5/sport-check-opens-1st-kids-only-concept-store*", "image": "Sport Chek Kids - Shoe Table.jpg", "id": 13}, {"title": "Aqua Dream", "summary": "Underwater Effect Projector", "body": "Night light projector for babies with moving waves and fishes that glow on the walls and ceiling. Available with a variety of soothing songs and different intensities of light. This plush is ideal for creating a peaceful atmosphere in the bedroom.\n\n\n*2018*\n*sources : pabobo.com*\n[vimeo=714450981]\n[lp=Aquadream (2).jpg]\n\n[lp=Aquadream (4).jpg]\n\n**&&Prototype&&**\n\n[sp=QQ 20180816142449.jpg][sp=Tortue Proto trim.jpg][sp=QQ图片20180816115715.jpg]\n\n[lp=Aquadream (8).jpg]", "image": "Aquadream Cover.jpg", "id": 14}, {"title": "Star Projector", "summary": "Mushroom night light", "body": "Night light projector for babies with a starry night show and music is perfect for soothing the babies and help them sleep. Available with a variety of songs and different intensities of light.\n\n\n*2018*\n*sources : pabobo.com*\n[vimeo=541077869]\n\n\n**&&Concept&&**\n\n[lp=Mushroom Concept (1).jpg]\n[sp=Mushroom Concept (3).jpg][sp=Mushroom Concept (2).jpg]\n\n\n**&&Prototype&&**\n\n[lp=Mushroom Proto (1).jpg]\n\n**&&Final Product&&**\n\n[lp=Mushroom Stars (5).jpg]", "image": "Mushroom Cover.jpg", "id": 15}, {"title": "Booth", "summary": "Lighting Show", "body": "This Booth was developed for a lighting show in New York. It uses transparency and cutout to pique the curiosity to what is inside. Luminaires flow through the structure and are allowed to exceed its limits. The booth is also used as the crate itself.\n\n*2022*\n\n[lp=Booth (3).jpg]\n\n\n**&&Shipping & Installation&&**\n\nThe booth is delivered closed with particle boards screwed in to protect it. In the installation, the structure separates in half diagonally and beams are screwed on top to form a pergola.\n\n[lp=Booth (4).jpg]\n\n**&&Details&&**\n\n[lp=Booth (2).jpg]\n[lp=Booth (1).jpg]\n[lp=Booth (5).jpg]", "image": "Booth (3).jpg", "id": 16}, {"title": "Drum", "summary": "Large Surface Luminaire", "body": "Bold, modern, and functional, Drum is a pendant and surface luminaire that provides a generous and wide spread of general lighting. The offset conical baffle adds a unique touch to this cylindrical fixture. Available in combinations of three diameters and three heights, this luminaire offers a wide variety of size and color configurations.\n\n*2020*\n[lp=DRUM SURFACE - C82 Trio Colors.jpg]\n\n**&&Process&&**\n\n[sp=Drum Process (1).jpg][sp=Drum Process (4).jpg][sp=Drum Process (2).jpg]\n\n**&&Final Product&&**\n\n[lp=Government of Canada Office (1).jpg]\n[lp=P82-scene.jpg]", "image": "DRUM SURFACE COVER.jpg", "id": 17}, {"title": "Y1234", "summary": "Modular Profile Luminaire", "body": "A minimal tapered aluminium profile that provides a wide spread of light. This versatile module can be assembled in different configurations to form a downlight, uplight or an array of light.\n\n*2020*\n\n[lp=Y1234 - P982 Main.jpg]\n\n{Y1[sp=Y1234 - P981.jpg]Y2[sp=Y1234 - P982.jpg]}\n{Y3[sp=Y1234 - P983.jpg]Y4[sp=Y1234 - P984.jpg]}\n\n\n**&&Sketches & Prototypes&&**\n\n[lp=Y1234 Sketch.jpg]\n\n[lp=Y1234-Prototype.jpg]\n\n\n**&&Vertical Variant&&**\n\n\n[lp=P994-SCENE.jpg]\n\n\n**&&Acoustic Felt Variant&&**\n\n\n[lp=P980-Scene.jpg]\n[sp=P980 - Aster(PETAL).jpg][sp=P980 - Aster(OVAL).jpg][sp=P980 - Aster(TRAPEZE).jpg]\n\nTo save space, the acoustic panels are shipped flat. The magnetic top cap is easily removed to reveal notches in which the panels are inserted and fastened with screws. Place the cap back.\n\n[lp=P980-INSTALLATION SITE.jpg]\n\n{[sp=Aster CAP ON.jpg][sp=Aster CAP OFF.jpg]}", "image": "Y2-Production.jpg", "id": 18}]