[{"body": "The website is good to go!\nAs you may know the RÉD association has voted yes to an unlimited strike and so I have a lot of time of my hands. therefore you should see more projects coming soon.\n\nThis one is a photoshop project I did for Infograhie 1. Originally, there was a friend of mine inside my chest posing as the mad mechanic!\n\n[lp=Mechanical Me.jpg]", "title": "Iman 2.0", "image": "Mechanical Me.jpg", "tags": ["photoshop"], "date": [6, 2, 2012], "id": 4}, {"body": "Since I haven't done many new projects - and the strike is not going to help - this is a project from last semester called \"chaise In-Situ\" or the integrated chair. \n\n\nWe had to design and build a seat integrated within the architecture of the building. We used some tricks to make the seat look like it's floating and we got inspired by the lines present in the environment to creat the seat itself. The hardest part was the teamwork!\n\n{[sp=Assise-Insitu.jpg]   [sp=Assise-Insitu2.jpg]   [sp=Assise-Insitu-Presentation.jpg]}", "title": "In-Situ", "image": "Assise-Insitu.jpg", "tags": [], "date": [8, 2, 2012], "id": 5}, {"body": "Back in 2006, in high school, I won the first prize in a 3D modeling contest for two consecutive years. I don't think the prize was valuable, if it was anything at all, but it was a very gratifying experience. \n\n\nI remember that it became my biggest hobby and I would even make some 3D models for my friends so they can also participate in the contest. Still I never thought that I someday I would want to become an industrial designer. \n\nAlso I've got to admit that I don't miss the hair!\n\n[lp=Highschool.JPG]", "title": "Back in 2006", "image": "Highschool.JPG", "tags": ["prize"], "date": [12, 2, 2013], "id": 6}, {"body": "It's been a while I've been working on this illustration and it finally paid off. It is drawn on both Illustrator and Photoshop. \n\n\nI asked for your vote to decide which proposition you like better and the winner is by a far margin the number 1. Thanks for your feed-backs!\n\n{[sp=CS-Proposition (1).jpg][sp=CS-Proposition (2).jpg]\n[sp=CS-Proposition (3).jpg][sp=CS-Proposition (4).jpg]}", "title": "Project Chainsaw", "image": "Chainsawcover.jpg", "tags": ["illustration", "photoshop"], "date": [2, 3, 2012], "id": 7}, {"body": "Hello there! \nThis time I present you a hand drawing from last semester called \"Rencontre inattendu\".\nThe story there could be interpreted in many ways so it's up to you to decide ;)\n\n[lp=Rencontre Inattendu.jpg]", "title": "Rencontre inattendu", "image": "Rencontre cover.jpg", "tags": ["hand drawing"], "date": [4, 3, 2012], "id": 8}, {"body": "Apparently it's back to school time! People have voted against the continuation of the strike. I'm kind of disappointed that it ended with no outcome, but on the other hand I'm happy to return to class. \n\n\nThis time I want to share with you a video we made last semester for a \"Charette\". It basically means that we had 3 hours to make any work on the subject \"Trash is always abundantly decorated\". It took a lot of hard work in that little time to take over 2000 pictures and edit them!\n\n[yt=MbzUoJTA378]", "title": "Charette Le Corbusier", "image": "Le Corbusier.png", "tags": ["charrette", "video"], "date": [11, 3, 2012], "id": 9}, {"body": "This is a project based on X-Acto from earlier on this semester. I decided use an automotive design approach to get it done. I'm planning to 3d model this later on. To be continued...\n\n\n[See the project here.](http://imankia.com/#/portfolio/XActo_Turbo)\n\n\n[lp=X-Acto Turbo 1.jpg][lp=X-Acto Turbo 2.jpg]", "title": "Electric Sharpener Meets the wheel", "image": "X-Acto Turbo 1.jpg", "tags": ["hand drawing", "product"], "date": [23, 3, 2012], "id": 10}, {"body": "Recently I was busy with many projects and reports for school. The good news is, I have completed many projects that I just can't wait to show you. The bad news is that my teacher has them all.. so I have to wait to get them back. \n\nSo this is a projects called \"Labyllard\" or, as my colleague would explain; the composition of the words labyrinthe and billard. We could only use hot glue, straw and paper and make it withstand the weight of a pool ball. We worked really hard and we had a great team work on this one so I hope you like it!\n\n\n[lp=Labyllard Final.jpg]\n\n{[sp=Labyllard progress.jpg][sp=Labyllard progress2.jpg]}\n[yt=1p5a8P5ACbw]", "title": "Labyllard", "image": "Labyllard Final.jpg", "tags": [], "date": [30, 4, 2012], "id": 11}, {"body": "It's been almost a month that you last heard of me, you probably though the website was dead. Well you know, I took some time to relax and to sort some things out. It's summer after all! \n\n\nI promise I will come with new cool projects during this summer; I have many ideas.\nThere's one project that I've been working on for about two weeks now and it's almost ready to be shown, so make sure you visit my site in a few days!\n\nFor now I present you a poster I made for a party I'm throwing. I like the minimalist effect of it. What d'you think?\n\n[lp=Geek Party.jpg]", "title": "It's Summer After All", "image": "Geek Party.jpg", "tags": ["poster"], "date": [3, 6, 2012], "id": 12}, {"body": "Ladies and gentlemen, I present you my first car ever on photoshop. Actually the sketch is from 2 years ago, before I started to study design, and I decided to finish it now. I still have a lot to improve on my technique, but I am proud of the outcome!\n\n[lp=Samand K14.jpg]", "title": "Samand Prototype", "image": "Samand K14.jpg", "tags": ["illustration", "transport", "photoshop"], "date": [5, 6, 2012], "id": 13}, {"body": "I got this cute little kitten to brighten you day :) .I drew it today for a friend at work, she's been asking for it for like 3 months.. This is the first time I draw furry things, it's actually fun to do!\n\n[lp=Kitten.jpg]", "title": "I lov catz", "image": "Kitten.jpg", "tags": ["hand drawing"], "date": [26, 5, 2012], "id": 14}, {"body": "I had some time to spare today so I did this one. It's the first time I use markers to draw cars. I have to admit that I'm contented with the result.\n\n[lp=Land Rover.jpg]", "title": "Land Rover With Markers", "image": "Land Rovercover.jpg", "tags": ["hand drawing", "transport"], "date": [25, 8, 2012], "id": 15}, {"body": "This is a drawing I did for a methodology report. The whole report was very painful to do, but this is the fun part of it. I though I would share that with you.\n\n\n[lp=Brouettes.jpg]", "title": "wheelbarrow", "image": "Brouettes.jpg", "tags": ["illustration"], "date": [19, 10, 2012], "id": 16}, {"body": "In this project. we had to redesign the portable version of the iconic Weber BBQ. I came up with a compact design that could be carried by hand or with a strap. For the next step, I will work with two other colegues and we will try to improve the design and finalize it.\n\n[lp=BBQ Finales.jpg]\n{[sp=BBQ Finales2.jpg][sp=BBQSketche1.jpg][sp=BBQSketche2.jpg]}", "title": "Urban Cooker", "image": "BBQSketche2.jpg", "tags": ["hand drawing"], "date": [23, 10, 2012], "id": 17}, {"body": "This is the final version of the Urban Cooker made in collaboration with Carlos Chavez and Sam Bonraisin. \nIt includes an ingenious chimney system for a quick start up and an original standing system. As for the shape, we were inspired by the original form of the BBQ that we extended on one side.\n[See the project here.](http://imankia.com/#/portfolio/Urban_Cooker)\n\n\n[lp=Urban Cooker (1).jpg]", "title": "Urban Cooker Final", "image": "Weber Cover Blog.jpg", "tags": ["cad", "product"], "date": [24, 8, 2103], "id": 18}, {"body": "This is what I was up to for the last two days. I did this after 3 weeks into learning Cinema4D.\nNow it's time to learn Rhino!\n\n\n[lp=Gibson.jpg]", "title": "Gibson on C4D", "image": "Gibson.jpg", "tags": ["cad"], "date": [27, 10, 2012], "id": 19}, {"body": "So as some of you know, I've been working a lot on the HEC project lately and it's almost ready! \nIn case you are interested in visiting the expo (and you should since there is lot of cool stuff that will be sold there), it takes place this Wednesday at 12pm. See the posters below. Hope see you there!\n\n[lp=Affiche HEC.jpg]\n\n[lp=Panache affiche.jpg]", "title": "HEC", "image": "Affiche HEC.jpg", "tags": ["poster"], "date": [2, 11, 2012], "id": 20}, {"body": "Here we are, after four weeks of intense work we opened the sale of our products at the HEC sale. All the students did wonderful jobs and almost everything was sold out. The Panache did great as well, we managed to sell everything and we even made profit out of it! It was a great experience to work in such an intensive way and I learned to plan ahead and move forward as quickly as possible.\n\nSo here is what the product and the stand look like (plus a handsome guy as a bonus)!\n\n[See the project here.](http://imankia.com/#/portfolio/Panache_The_Knife_Stand)\n\n\n[lp=Panache.jpg]\n\n[lp=Iman HEC.jpg]", "title": "Panache", "image": "Panachecover.jpg", "tags": ["product"], "date": [8, 11, 2012], "id": 21}, {"body": "It might look just like any tide bottle but it's not just any bottle. It's the first model I've done using Rhino!\n\n\n\nThe design itself is not great but 4 different programs went into the making of it: Rhino, SolidWorks, Cinema4D and Photoshop. \n\nMore projects to come soon!\n\n[lp=Bouteille Tide.jpg]", "title": "Tide Bottle", "image": "Bouteille Tide.jpg", "tags": ["cad"], "date": [11, 11, 2012], "id": 22}, {"body": "If you are reading this, it means you survived the end of the world, congradulatoin.\nSo here's some work I did last semester. These are some sofas I sketched  using only black pencil and grey markers.\n\n[lp=Sofa Zoom3.jpg]\n[lp=Sofa Zoom2.jpg]\n\n{[sp=Sofa-Sketch1.jpg][sp=Sofa-Sketch2.jpg][sp=Sofa-Sketch3.jpg]}", "title": "Zoom Sofa", "image": "Sofa Zoom2.jpg", "tags": ["furniture", "hand drawing"], "date": [23, 11, 2012], "id": 23}, {"body": "So it's Christmas time and I've been pretty lazy. Although I came up with a concept for my tramway project. Now I only got to figure out the goddamn program and make this in 3D!\n\n[lp=Tramway Sketch.jpg]\n\n[See the project here.](http://imankia.com/#/portfolio/The_Grid_Tramway)", "title": "Merry Christmas", "image": "Tramway Sketch.jpg", "tags": ["hand drawing", "transport"], "date": [26, 11, 2012], "id": 24}, {"body": "Some sketches from last semester with pencil and marker.\n\n\n[lp=ZAP 1.jpg]\n{[sp=ZAP Sketch 2.jpg][sp=ZAP Sketch 1.jpg]}", "title": "ZAP", "image": "ZAP 1.jpg", "tags": ["hand drawing", "product"], "date": [29, 11, 2012], "id": 25}, {"body": "This is a design for my wood class. I was asked to conceive a wooden furniture for kids and describe each part and its assembly. So I came up with a furniture the 7 year old me would've loved to have; A slide/library! \n\n\nIn order to climb on top, you have to pull a drawer that acts like stairs. It’s just the best of the two worlds. \nThanks to Milena for sharing this [on her blog](http://inmeinemzimmer.at/2013/02/02/iman-kia-meuble-enfant/)!\n\nNow I have to give a last push for the next two weeks to finish this semester with good marks. Wish me luck!\n\n[lp=Meuble Enfant1.jpg]\n[lp=Meuble Enfant2.jpg]", "title": "Meuble pour enfant", "image": "Meuble Enfant2.jpg", "tags": ["hand drawing", "furniture"], "date": [6, 0, 2013], "id": 26}, {"body": "Hello everyone! It’s been a while. Things got very intense this last month but I’m proud to say that it paid off! I did some fine projects and eventually I was selected to study abroad! That's right, I'm going to Germany baby!  \n\n\nThat being said, I present you with a fun Charrette about a First Aid kit. We came out with an original way to organize the supplies in order to make it easier to locate the appropriate treatment, when in an emergency situation. It was a good teamwork!\n\n[lp=Soins-Bernard1.jpg]\n[lp=Soins-Bernard2.jpg]", "title": "Charrette For A First Aid Kit", "image": "Soins-Bernard1.jpg", "tags": ["charrette", "product"], "date": [10, 1, 2013], "id": 27}, {"body": "This semester started a little roughly, mainly because I was overwhelmed and it affected my works so far. Now that I work less, it should be smoother.\n\n\nSo right now I'm working on an exterior seating for bikers. I considered comfort, speed and fluidity as inspirations. So far I got these Ideas. Still a lot to improve!\n\n[lp=Bench Concepts.jpg]", "title": "Benches Are For Bikers Too", "image": "Bench Concepts.jpg", "tags": ["furniture", "illustration"], "date": [15, 1, 2013], "id": 28}, {"body": "The Canal Chair is designed for the recreational sites of canal Lachine. Its design fits perfectly with the surrounding and it’s discrete yet elegant appearance gives it a timeless look.\n\n[See the project here.](http://imankia.com/#/portfolio/Chaise_Canal)\n\n\nSo I did survive this epic week, I had so little time left for this last project, but I think I still made something worthy. I would like to say that next time I’ll take things in advance, but I know me way too well…\n\n\n[lp=Chaise Canal2.jpg]", "title": "Chaise Canal", "image": "Canal Chaise Magenta Croped.jpg", "tags": ["product", "furniture"], "date": [14, 2, 2013], "id": 29}, {"body": "Hello guys, I'm pleased to welcome you to my new website!\nThanks a lot to my brother [Ehsan Kia](http://ehsankia.com) for helping me build this new version of the site. Now that the website is looking neat, it's time to make some great work to expose here.\n\n[lp=welcome to imankia v20.jpg]", "title": "Imankia 2.0", "image": "welcome to imankia v20.jpg", "tags": [], "date": [25, 8, 2013], "id": 30}, {"body": "First of all, thank you all for the kind comments about the website. Hope the content will be worthy of your attention. At least I'll try my best!\n\n\nThis semester I have a transport design class in which we are designing an electric bike that would fit inside an electric car. These are two propositions I made that are pretty compact. The first proposition got chosen and I am now working on improving it. To be continued!\n\n[lp=Proposition 1.jpg]\n[lp=Proposition 2.jpg]", "title": "The bike of tomorrow", "image": "Proposition 1.jpg", "tags": ["transport", "illustration"], "date": [26, 8, 2013], "id": 31}, {"body": "As I said last week, I am working on a concept of an electric bike. The goal is to follow the style of the new BMW i3. After an intense weekend of work, this is the result I presented in class.\n\n\nThe bike is made to be foldable so it fits nicely the trunk of any car. Moreover, it has a solar panel that allows it to charge while not in use. There is still some work to do on the folding mechanism, but it's going well.\n\n[See the project here.](http://imankia.com/#/portfolio/Bi_The_Urban_Bike)\n\n\n[lp=Bi Concept.jpg]", "title": "Bi - The Urban Bike", "image": "Bi Concept.jpg", "tags": ["transport", "illustration", "photoshop"], "date": [2, 9, 2013], "id": 32}, {"body": "In winter 2013, we organised the graduates exposition and we though it would be cool to build a photo booth where people could freely photograph themselves.\n\n\nThis wallpaper was done in the laps of 3 days by two of my friends and I. You can see the video of the process below.\n\n\n[See the project here.](http://imankia.com/#/portfolio/Photobox)\n\n\n[lp=3 Artists.jpg]\n{*The three artists : Alexandre Dicaire, Gary Texier, Iman Kia*}\n\n<iframe src=\"//player.vimeo.com/video/85167195?title=0&amp;color=ffffff\" width=\"700\" height=\"393\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe>", "title": "PhotoBox", "image": "3of us.jpg", "tags": ["hand drawing", "video"], "date": [4, 9, 2013], "id": 33}, {"body": "Few weeks ago, I presented my concept in front the critics and I got good feedback that help me improve my concept. Since then I've been working hard to bring it to term. Here it is for your pleasure!\n\n\n\n***Bi*** is a foldable electric bike designed as an alternative for cars for small trips into the city.\n\n[lp=Bi Open.jpg]\n\n\n The ingenious folding mechanism provides a quick and elegant transition into a very compact shape. That way, the bike can be easily installed into the trunk of a car.\n\n[lp=Bi Pliage.jpg]\n\n[See the project here.](http://imankia.com/#/portfolio/Bi_The_Urban_Bike)", "title": "Bi, the urban bike - finished", "image": "Vue Derriere croped.jpg", "tags": ["transport", "cad", "product"], "date": [2, 10, 2013], "id": 34}, {"body": "First, happy late new year! In the last two months I finished a tough semester, because of all the work and personal stuff I had to do on the side. This new year will bring lot of cool challenges that and I can't wait to succeed!\n\n\nFirst off, I've been polishing old and new projects these last few weeks and my portfolio will be soon published on this same website! As I mentioned before, I am going to Germany to study one semester at the Kunsthochschule-Halle, so in the meanwhile I don't have much else to do than work on my projects or maybe try to find an internship. We'll see.\n\nHere is one of my old projects, from back in 2011, that I touched up. It is an electric pen sharpener, with a wheel to rewind the wire, because everything is cooler with a big wheel!\n\n[See the project here.](http://imankia.com/#/portfolio/XActo_Turbo)\n\n\n[lp=X-Acto Poster.jpg]", "title": "In the limbo", "image": "X-Acto Blog Cover.jpg", "tags": ["cad", "product"], "date": [14, 0, 2014], "id": 35}, {"body": "Hello there. The Portfolio section of the website is now ready and I'm very happy with it, so check it out! \nThe project below is a tramway I did in 2012 for my infographic class. The original concept was inspired by Tron and there was an animation that I had made for it, but I have to work on it before I post it here. \n[See the whole project here](http://imankia.com/#/portfolio/The_Grid_Tramway)\n\n\nIn other news, I started an internship at [Morelli design](http://www.morellidesigners.com/). It will be my first real experience in design. So far it's going well, it is starting with small task but I'm ready for more. We'll see how it evolves.\n\n\n[lp=Tramway Above.jpg]", "title": "imankia.com 2.2", "image": "Tramway blog cover.jpg", "tags": ["transport", "news"], "date": [17, 1, 2014], "id": 36}, {"body": "Alright, so in the last few weeks I finished my internship at Morelli Designers and I can say that it was a good experience with great coworkers. \n\n\nThen after I had just enough time to say goodbye to my friends and then it was already time to leave for Germany. I feel lucky to have so many great friends in Montreal and I already miss you guys.\n\nHere, things are going smoothly. I just came back from a trip in Hamburg and Berlin with a friend and like any respectable designer, I visited the Bauhaus museum among others.\n\nThis is a shot of the Leipziger Str close to where I live, it's really lovely.\nCheers!\n\n\n\n\n[lp=2014-03-25 15.22.23.jpg]", "title": "Grüße aus Halle", "image": "2014-03-25 15.22.23.jpg", "tags": ["news"], "date": [26, 2, 2014], "id": 37}, {"body": "These last two weeks I got really used to doing nothing and relaxing. I used this time to explore the city, make some friends and eat ice cream. I don't know what's the deal with Germans and ice cream but I can't complain!\n\n\n[lp=2014-04-02 11.24.jpg]\n{*Downtown, on a city tour with school*}\n\nThis week is the introductory week for us exchange students, as we are being introduce to the well equipped workshops of our university. Everything is very well organised for us and our assigned tutor are a great help. Next week the real classes will start and I think it's gonna be a good semester.\n\n\nAnyways, this project below is an animation I made for a friend of mine, [Delphine](http://design2013.umontreal.ca/din/potager-urbain/), last year. It's her final project about a gardening solution for small appartments. This animation is meant to explain the assembly.\n\nTill next time,\nTschüss!\n\n\n<iframe src=\"//player.vimeo.com/video/87407005?title=0&amp;color=ffffff\" width=\"700\" height=\"394\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe>", "title": "Back To School", "image": "2014-04-02 11.24.jpg", "tags": ["news", " render"], "date": [2, 3, 2014], "id": 38}, {"body": "Hello Folks, it is already half way into my journey in Halle but I feel like so much has already happened in this little time! One of the cool events was the trip to Milan for the Salon Di Mobile (Design Week) with some friends from Montreal.\n\n\n[lp=Milan Compilation site.jpg]\n\n\nWe visited the student expos and it is a must for any design student. Then we went to the main fair, which was not worth the time nor the money in my opinion. Of course we did a lot of pizza breaks. During this week, the city is a big celeration that doesn't stop. We event ran across Ronan Bouroullec in the streets!\n\n\n[lp=Milan 2.jpg]\n{*Ben just shook hand with R Bouroullec*}\n\n\nThe trip was a bit expensive but great. It was a weird feeling to see so many of my friends from Montreal at the other side of the world. And now I am well inspired to start the semester!!\n\n\n[lp=Milan 1.jpg]\n{*Visiting Milan with friends*}", "title": "Salon Di Mobile 2014", "image": "Milan Cover.jpg", "tags": ["update"], "date": [28, 4, 2014], "id": 39}, {"body": "Hi!\nIt's been a crazy semester here in Halle and I didn't have time to write alot on this blog, but new contents will follow up soon.\n\n\nSo I am officially done with my project and tomorrow is the annual exposition at the Burg. Can't wait to hear some feedback from the public.\n\nI will post my project soon on the website, and I'll just say for now that it is about the Bonsai tree!\n\n[lp=Bonsai Care.jpg]\n{*Trimming my bonsai before the exposition*}", "title": "Bonsai", "image": "Bonsai Care Cover.jpg", "tags": [], "date": [18, 6, 2014], "id": 40}, {"body": "Finally updated my portfolio! There are two new projects that i'm excited to present to you. Also, now I finished my bachelor! So it's a new beginning for me. \n\n\nFirst, my main project from Burg Giebichenstein, Germany. The workshop was about the subject of fleeing time and I though how can we see the big picture in the passage of time. It made me think of the plants, because they grow slowly and they need care, just like us and we can only see their growth with time. therefore I settle with the bonsai, which has a nice symbolic to it. You can see the whole project [here](http://imankia.com/#/portfolio/Tisch_der_Geduld)\n\n[lp=Tisch render.jpg]\n\nSecond, is my final bachelor project that I was working on this last year, back in Montreal. Again, it's a very sensitive approach to a problem that might seem anodyne at first, but nevertheless needs to be addressed. This time, the subjects are subway musicians who usually go unnoticed or ignored. My goal was to encourage people to interact with them and take them more seriously, because some of them are actually great artists.\nYou can see the whole project [here](http://imankia.com/#/portfolio/Maestro)\n\n[lp=Poster Render.jpg]\n\nSo, for now, I am finishing my portfolio and some other stuff that need to be done. After that I will be actively looking for a job, so whatch out!", "title": "New beginning", "image": "Expo cover.jpg", "tags": ["news update"], "date": [15, 4, 2015], "id": 41}, {"body": "Hello world", "title": "Test", "image": "Bonsai Cover.jpg", "tags": [], "date": [7, 9, 2018], "id": 42}]